{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Metadata describing implemented Valentine features and the files involved.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files for quick reference.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styling.",
  "frontend/index.html": "Root HTML mounting point loading main.tsx for the React app.",
  "frontend/src/App.tsx": "Renders the ValentineProposalExperience as the app's sole component.",
  "frontend/src/features/particleSlideshow/engine.ts": "Canvas particle engine handling particle count, pixel sampling, animation states, and transitions.",
  "frontend/src/features/particleSlideshow/fit.ts": "Utility to scale and center images within a canvas while preserving aspect ratio.",
  "frontend/src/features/particleSlideshow/particleSlideshow.css": "Styles for the fullscreen particle slideshow, loading UI, and final text animation.",
  "frontend/src/features/particleSlideshow/ParticleSlideshowModule.tsx": "Loads an image, initializes the particle engine, shows a loading spinner, and reveals final text after animation.",
  "frontend/src/features/particleSlideshow/preload.ts": "Utility for asynchronously preloading images and returning them as HTMLImageElements.",
  "frontend/src/features/valentine/components/CelebrationOverlay.tsx": "Creates falling emoji items and sparkles for the Yes celebration overlay.",
  "frontend/src/features/valentine/components/CharacterStage.tsx": "Displays guy or cat character states based on No-click count with corresponding animations.",
  "frontend/src/features/valentine/components/HeartOnlyButton.tsx": "Glowing animated heart button used to advance to the particle slideshow.",
  "frontend/src/features/valentine/motion.ts": "Defines shared animation timing, easing, delays, and a helper to generate CSS transition strings.",
  "frontend/src/features/valentine/screens/FinalLoveMessageScreen.tsx": "Renders the final love message screen with romantic text and a button that advances to the next step.",
  "frontend/src/features/valentine/screens/LongEmotionalMessageScreen.tsx": "Displays a long emotional message and a heart button that triggers a callback.",
  "frontend/src/features/valentine/screens/ProposalScreen.tsx": "Shows an interactive Valentine proposal with Yes/No logic, character reactions, and a celebration overlay.",
  "frontend/src/features/valentine/valentine.css": "Contains animations and styling for Valentine screens, floating hearts, character states, and romantic message layouts.",
  "frontend/src/features/valentine/ValentineProposalExperience.tsx": "Controls the four-step Valentine flow and switches between screens based on state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/index.css": "Defines global Tailwind base styles and a pastel Valentine color theme with custom fonts.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom Valentine colors, fonts, animations, and extended utilities.",
  "project_state.json": "Defines the project’s state and requirements for a romantic single‑page Valentine’s website with smooth animations, a multi‑step Yes/No story, and a canvas-based particle slideshow. Includes architectural notes, known issues, image requirements, and a list of existing features."
}